{
  "backend/main.mo": "Main actor implementing item, basket, user, branding, and Stripe state plus authorization and storage mixins with basket add/remove/query logic.",
  "backend/migration.mo": "Migration module defining old/new actor state and returning prior state unchanged for upgrades.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected frontend files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries for many frontend files describing routing, components, admin tools, and storefront behavior.",
  "frontend/index.css": "Tailwind base theme defining light/dark OKLCH color variables and applying global styles.",
  "frontend/index.html": "HTML entrypoint mounting the root element and loading the main React script.",
  "frontend/src/App.tsx": "App root configuring routes, layout, header with basket and login, footer, theming, and profile setup.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when a non-admin accesses restricted pages, offering navigation back to storefront.",
  "frontend/src/components/AdminItemEditor.tsx": "Admin editor allowing updating an item's description and replacing its image with validation and upload handling.",
  "frontend/src/components/AdminPublishToggle.tsx": "Provides a button and status badge allowing admins to publish or unpublish an item with loading states and toast feedback.",
  "frontend/src/components/ItemCard.tsx": "Displays an item’s image, title, description, price, and sold badge, and navigates to the item detail page when clicked.",
  "frontend/src/components/LoginButton.tsx": "Handles login/logout via Internet Identity and shows admin-specific menu options when the user is an admin.",
  "frontend/src/components/Model3DViewer.tsx": "Renders a 3D model using three.js with orbit controls, fallback UI, and basic error handling.",
  "frontend/src/components/PriceEditor.tsx": "Allows admins to edit an item’s price with validation and saves changes via a mutation hook.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts authenticated users without a profile to enter their name and saves it before proceeding.",
  "frontend/src/components/StorefrontHeroMedia.tsx": "Displays a hero section using either a 3D model or background image along with dynamic title and subtitle text.",
  "frontend/src/components/StripeSetup.tsx": "Modal dialog for entering Stripe secret key and allowed countries, saving configuration via a mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBasket.ts": "Manages a localStorage-backed basket of item IDs with add, remove, clear, and lookup utilities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as items, profiles, admin checks, and pricing.",
  "frontend/src/hooks/useStripe.ts": "Implements React Query hooks for Stripe-related backend operations like configuration, checkout sessions, and session status.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, typography, and theme customization for light and dark modes.",
  "frontend/src/lib/idEncoding.ts": "Utility functions for encoding and decoding item IDs between Uint8Array and URL‑safe base64 strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin interface for editing branding assets, hero media, and app text with file upload and preview support.",
  "frontend/src/pages/AdminBulkUploadPage.tsx": "Admin page for bulk uploading images, tracking progress, verifying uploads, and updating item caches.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin dashboard showing Stripe configuration status and navigation to branding settings, with gated access based on admin checks.",
  "frontend/src/pages/BasketPage.tsx": "Displays basket items, handles removing items and checkout flow, and validates item availability and Stripe configuration.",
  "frontend/src/pages/ItemDetailPage.tsx": "Shows item details with purchase, basket, and admin edit options, including Stripe checkout and media handling.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment cancellation screen offering navigation back to the storefront or basket.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirms successful payment, clears basket, refreshes item data, and allows returning to the storefront.",
  "frontend/src/pages/StorefrontPage.tsx": "Loads and displays storefront hero media and a grid of available items with loading and empty states.",
  "frontend/src/utils/brandingMedia.ts": "Validates uploaded hero media, infers content type, and builds media descriptors for images and 3D models.",
  "frontend/src/utils/bulkUploadVerification.ts": "Verifies bulk-uploaded items by fetching each one and confirming its associated image is accessible.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, fonts, animations, and container settings, and enabling typography, container-queries, and animation plugins.",
  "project_state.json": "JSON snapshot describing project state, requirements, features, architectural notes, and known issues for the storefront and admin system."
}