{
  "backend/main.mo": "Main actor defining Item, Branding, and UserProfile types with persistent state for items, profiles, Stripe config, and baskets. Includes basket management, bulk upload, pricing, checkout, and admin functions with access control.",
  "backend/migration.mo": "Migration module that updates item prices by category: 3D printed items to 900 cents ($9) and ceramic items to 1900 cents ($19).",
  "feature_evidence.json": "Feature evidence report documenting the bulk price updates by category feature with high confidence, listing frontend components and test IDs.",
  "frontend-file-summaries.txt": "Summaries of frontend files including components for storefront, admin panel, pricing editor, bulk upload, payment flows, and the new useUpdateAllItemPricesByCategory hook for category-based pricing.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Production deployment checklist for Draft Version 13 covering storefront functionality, view mode dropdown visibility, admin features, payment flow, cross-browser testing, and performance verification.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining design tokens for background, foreground, borders, and UI components.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'Ocarina Market', and script loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup, layout including header with basket icon and item count badge, footer with branding, and routes for storefront, item detail, basket, admin, and payment pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component with shield icon, error message for non-admin users, and button to return to storefront.",
  "frontend/src/components/AdminItemEditor.tsx": "Admin component for editing item descriptions and replacing item photos with file upload, using mutations and toast notifications.",
  "frontend/src/components/AdminPublishToggle.tsx": "Toggle button component for admins to publish/unpublish items with loading states and status badge display.",
  "frontend/src/components/CategoryPriceEditor.tsx": "Bulk pricing tool that sets all 3D printed items to A$9.00 and ceramic items to A$19.00 via a single mutation.",
  "frontend/src/components/ItemCard.tsx": "Card component displaying item thumbnail, title, description, price, and sold status with navigation to detail page on click.",
  "frontend/src/components/LoginButton.tsx": "Authentication button with Internet Identity integration, showing login/logout options and admin dropdown menu for authenticated admins.",
  "frontend/src/components/Model3DViewer.tsx": "3D model viewer using React Three Fiber to render OBJ files with orbit controls, lighting, and error handling.",
  "frontend/src/components/PriceEditor.tsx": "Form component for admins to set individual item prices in AUD with validation and mutation handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog that prompts authenticated users without profiles to enter their name on first login.",
  "frontend/src/components/StorefrontHeroMedia.tsx": "Hero section component that displays either a 3D model or image background with customizable title and subtitle text overlay.",
  "frontend/src/components/StripeSetup.tsx": "A dialog component for configuring Stripe payment settings, allowing users to input a secret key and comma-separated country codes.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance, creating it with the current Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBasket.ts": "React hook that manages a shopping basket in localStorage, providing methods to add, remove, clear, and check items using Uint8Array IDs.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including items, user profiles, branding, categories, and admin operations.",
  "frontend/src/hooks/useStripe.ts": "React Query hooks for Stripe integration including configuration checks, checkout session creation from basket or items, and session status retrieval.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earthy color palette for light and dark themes, plus typography settings.",
  "frontend/src/lib/idEncoding.ts": "Utility functions to encode Uint8Array item IDs to URL-safe base64 strings and decode them back.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin page for configuring storefront branding including app name, logo, hero media (image/video), and hero text with file upload, preview, and validation capabilities.",
  "frontend/src/pages/AdminBulkUploadPage.tsx": "Admin page for bulk uploading multiple product images with category selection, progress tracking, verification, and navigation to uploaded items.",
  "frontend/src/pages/AdminPanelPage.tsx": "Main admin dashboard providing access to Stripe configuration, category pricing, branding settings, bulk upload, and batch operations like updating printed item descriptions.",
  "frontend/src/pages/BasketPage.tsx": "Shopping basket page displaying selected items with total price calculation, item removal, and checkout flow with Stripe integration and sold-item validation.",
  "frontend/src/pages/ItemDetailPage.tsx": "Product detail page showing item photo, title, description, price, and purchase options (buy now or add to basket) with admin editing capabilities and guest checkout support.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment cancellation confirmation page informing users their payment was cancelled and providing navigation back to storefront or basket.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays payment confirmation after successful Stripe checkout, verifies session status, clears basket, and invalidates item queries to refresh sold status.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page displaying items with hero media, filtering/sorting controls (all, price, category), and responsive grid layout.",
  "frontend/src/utils/brandingMedia.ts": "Validates and processes hero media files (images and 3D models), inferring content types and building MediaKind objects for supported formats.",
  "frontend/src/utils/bulkUploadVerification.ts": "Verifies bulk uploaded items are retrievable and their images are accessible by fetching each item and performing HEAD requests on image URLs.",
  "frontend/src/utils/currency.ts": "Formats prices from cents to Australian Dollar currency strings using Intl.NumberFormat.",
  "frontend/src/utils/itemCategory.ts": "Maps between ItemCategory enum values and UI labels ('3D printed', 'Ceramic'), providing conversion functions and category options.",
  "frontend/src/utils/storefrontListing.ts": "Defines ViewMode types and applies filtering/sorting logic to item lists (all, price ascending/descending, category filter).",
  "frontend/src/utils/urlParams.ts": "Extracts and manages URL parameters from query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme properties, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking feature requests for an ocarina e-commerce store, including pending requests for price updates, category management, and item editing capabilities."
}