{
  "backend/main.mo": "Actor implementing item, branding, user profile, basket, and access-controlled operations with persistent maps and storage/authorization mixins.",
  "feature_evidence.json": "Feature evidence metadata linking a specific bulk-upload verification feature to related frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their roles in UI, routing, hooks, and admin features.",
  "frontend/index.css": "Tailwind base file defining OKLCH theme tokens, dark mode values, and global background/foreground styles.",
  "frontend/index.html": "Minimal HTML scaffold mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main router and layout component configuring header, footer, profile dialog, and all route definitions.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen that informs users they lack admin permissions and offers a button back to the storefront.",
  "frontend/src/components/AdminItemEditor.tsx": "Admin editor allowing description updates and image replacement for an item with validation and toast feedback.",
  "frontend/src/components/AdminPublishToggle.tsx": "Admin control to publish or unpublish an item using mutations with loading states and toast notifications.",
  "frontend/src/components/ItemCard.tsx": "Displays an item card with image, title, description, price, and sold badge, navigating to the item page on click.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout and shows admin or user actions based on authentication and admin status.",
  "frontend/src/components/Model3DViewer.tsx": "Renders a 3D model using Three.js with fallback and error handling inside a React Suspense canvas.",
  "frontend/src/components/PriceEditor.tsx": "Provides a UI to edit and save an item's price, validating input and updating via mutation.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter their name and save their profile.",
  "frontend/src/components/StorefrontHeroMedia.tsx": "Displays hero media as either a 3D model or background image along with customizable title and subtitle.",
  "frontend/src/components/StripeSetup.tsx": "Dialog for configuring Stripe with a secret key and allowed countries, saving via mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBasket.ts": "Manages a localStorage-backed basket of item IDs with add, remove, clear, and lookup utilities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating backend data such as items, user profiles, admin status, and item updates.",
  "frontend/src/hooks/useStripe.ts": "Implements react-query hooks for Stripe config, checkout session creation, and session status retrieval via backend actors.",
  "frontend/src/index.css": "Sets up Tailwind and defines light/dark theme CSS variables and base typography styles.",
  "frontend/src/lib/idEncoding.ts": "Utility functions to encode and decode Uint8Array IDs using URL‑safe base64.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin interface for editing branding settings, uploading logo/hero media, and saving updates to the backend.",
  "frontend/src/pages/AdminBulkUploadPage.tsx": "Admin tool for bulk image upload with progress tracking, backend verification, and cache invalidation.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page that checks admin and Stripe status and provides controls for configuring payments and branding.",
  "frontend/src/pages/BasketPage.tsx": "Displays basket contents, validates item availability, and initiates Stripe checkout for eligible items.",
  "frontend/src/pages/ItemDetailPage.tsx": "Shows item details, supports admin editing, basket additions, and direct Stripe checkout with validation.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Informs the user that payment was cancelled and offers navigation back to the storefront or basket.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirms successful payment, clears the basket, refreshes item data, and provides navigation back to the storefront.",
  "frontend/src/pages/StorefrontPage.tsx": "Loads and displays storefront hero media and a grid of published items, with a loader and empty state handling.",
  "frontend/src/utils/brandingMedia.ts": "Validates hero media files, infers content types, and builds MediaKind objects for images and 3D models.",
  "frontend/src/utils/bulkUploadVerification.ts": "Verifies bulk‑uploaded items by checking existence and accessibility of each item's image via backend and HEAD requests.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Tracks current project state, features, architecture notes, and known issues for the storefront and admin system."
}