{
  "backend/main.mo": "Defines basket, item, and user profile management with authorization, storage mixins, and Stripe checkout logic.",
  "feature_evidence.json": "Lists implemented features, their associated files, components, and test IDs for basket and checkout functionality.",
  "frontend-file-summaries.txt": "Contains high-level summaries for numerous frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles and theme variables defining color tokens for light and dark modes.",
  "frontend/index.html": "Static HTML root that loads the React app entrypoint.",
  "frontend/src/App.tsx": "Main app layout and router configuration with branding, header basket count, and route definitions.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Renders an access-denied UI with navigation back to the storefront.",
  "frontend/src/components/AdminItemEditor.tsx": "Admin tool for editing item descriptions and uploading replacement images with validations and mutation hooks.",
  "frontend/src/components/ItemCard.tsx": "Displays an item card with image fallback, price formatting, and navigation to the item detail page.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout and shows admin or user controls based on authentication state.",
  "frontend/src/components/PriceEditor.tsx": "Provides a UI to edit an item's price and save updates via mutation with validation and toasts.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter a name and saves the profile.",
  "frontend/src/components/StripeSetup.tsx": "Dialog allowing admins to configure Stripe secret key and allowed countries, saving via a mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBasket.ts": "Manages a localStorage‑persisted basket of item IDs with add, remove, clear, and lookup utilities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, managing identity state, login, and logout.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating items, user profiles, admin status, and branding through an actor interface.",
  "frontend/src/hooks/useStripe.ts": "Implements React Query hooks for Stripe config, checkout session creation, and session status retrieval via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes and typography styles.",
  "frontend/src/lib/idEncoding.ts": "Utility functions to convert Uint8Array IDs to and from URL‑safe base64 strings.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin UI allowing branding editing including store name, logo, and hero image with save actions.",
  "frontend/src/pages/AdminBulkUploadPage.tsx": "Admin page for bulk uploading images as items with progress tracking and success/error handling.",
  "frontend/src/pages/AdminPanelPage.tsx": "Main admin dashboard showing Stripe configuration status and navigation to branding and setup sections.",
  "frontend/src/pages/BasketPage.tsx": "Displays basket items, handles item removal, checkout validation, and initiates Stripe checkout sessions.",
  "frontend/src/pages/ItemDetailPage.tsx": "Shows item details, supports adding to basket or buying immediately, and allows admin editing and Stripe setup if needed.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment-cancelled message with navigation options back to the storefront or basket.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirms successful payment, clears the basket, refreshes item data, and provides a link back to the storefront.",
  "frontend/src/pages/StorefrontPage.tsx": "Fetches and displays all storefront items along with branding, including a hero section and item grid.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, feature definitions, architectural notes, and current storefront/admin requirements for an ocarina shop app."
}