{
  "backend/main.mo": "Main canister defining items, branding, profiles, basket operations, and authorization with storage mixins and Stripe config.",
  "backend/migration.mo": "Migration module transforming old branding into new branding format with hero text while preserving existing state.",
  "feature_evidence.json": "Feature evidence report mapping frontend files to implemented features, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for reference.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "Root HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app layout with routing, header branding, basket indicator, authentication UI, and page route definitions.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component showing an access denied message and navigation button for non-admin users.",
  "frontend/src/components/AdminItemEditor.tsx": "Provides UI for admins to edit an item's description and upload a replacement image using mutation hooks.",
  "frontend/src/components/AdminPublishToggle.tsx": "Renders a toggle to publish or unpublish an item, showing current status and handling async mutations.",
  "frontend/src/components/ItemCard.tsx": "Displays an item preview card with image, title, description, price, and navigation to the item detail page.",
  "frontend/src/components/LoginButton.tsx": "Handles authentication via Internet Identity and shows login, logout, or admin menu options based on user state.",
  "frontend/src/components/Model3DViewer.tsx": "Loads and displays a 3D model in a Three.js canvas with controls and fallback handling.",
  "frontend/src/components/PriceEditor.tsx": "Allows admins to edit and save an item's price with validation and mutation status feedback.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts newly authenticated users to enter their name and saves the profile via mutation.",
  "frontend/src/components/StorefrontHeroMedia.tsx": "Shows the storefront hero section using either a 3D model or image plus customizable title/subtitle.",
  "frontend/src/components/StripeSetup.tsx": "Dialog for entering and saving Stripe secret key and allowed countries to configure payments.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBasket.ts": "Manages a list of item IDs in localStorage with add, remove, clear, and retrieval helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and exposing login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for items, profiles, admin checks, and mutations.",
  "frontend/src/hooks/useStripe.ts": "Defines React Query hooks for Stripe config checks, updates, checkout session creation, and session status retrieval.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes with custom typography settings.",
  "frontend/src/lib/idEncoding.ts": "Encodes and decodes Uint8Array IDs to and from URL‑safe base64 strings.",
  "frontend/src/main.tsx": "Renders the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin page allowing branding edits including app name, logo, hero media, and hero text, with file upload handling.",
  "frontend/src/pages/AdminBulkUploadPage.tsx": "Admin page for selecting multiple image files, tracking upload progress, and performing bulk photo uploads to create items.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin settings page showing Stripe configuration status and navigation to branding and other admin tools.",
  "frontend/src/pages/BasketPage.tsx": "Displays basket contents, validates item availability, and initiates Stripe checkout for eligible items.",
  "frontend/src/pages/ItemDetailPage.tsx": "Shows detailed item info with purchase options, admin editing tools, and Stripe checkout flow.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple page indicating a cancelled payment with navigation back to storefront or basket.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles post-payment confirmation, clears basket, refreshes item data, and displays success messaging.",
  "frontend/src/pages/StorefrontPage.tsx": "Public storefront showing hero media and a grid of available items.",
  "frontend/src/utils/brandingMedia.ts": "Utility functions for validating, inferring content type, and constructing media metadata for branding uploads.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Defines the project’s current state, version, features, and architectural notes for the storefront and admin system."
}