{
  "backend/main.mo": "Main backend actor defining Item, Branding, and UserProfile types with functions for basket management, item CRUD, bulk uploads, shape categories, Stripe checkout, and access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features related to diagnosing application loading issues and ensuring frontend routing/React rendering after Version 19 deployment, both targeting App.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, describing the folk market aesthetic, routing setup, admin features, payment flows, and shape category management.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Production deployment checklist for Draft Version 13 covering storefront functionality, view mode dropdown visibility, filtering/sorting, admin features, payment flow, cross-browser testing, and performance verification.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color palette for light and dark modes with warm earthy tones (terracotta, clay, sand) for folk market aesthetic.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Ocarina Market', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component setting up TanStack Router with all routes, QueryClient provider, layout with header (logo, basket icon with count, login button), footer with social links and caffeine.ai attribution, ProfileSetupDialog, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page component displaying shield alert icon, 'Access Denied' message for non-admin users, and button to return to storefront.",
  "frontend/src/components/AdminItemEditor.tsx": "Admin component for editing item descriptions, viewing shape categories (read-only), and uploading new item photos with file validation and toast notifications.",
  "frontend/src/components/AdminPublishToggle.tsx": "Toggle button component that allows admins to publish or unpublish items, displaying current status with a badge and handling state changes with toast feedback.",
  "frontend/src/components/CategoryPriceEditor.tsx": "Bulk pricing tool that updates all items by category (3D printed to A$9.00, Ceramic to A$19.00) with a single button click.",
  "frontend/src/components/ItemCard.tsx": "Displays an item card with image, title, description, price, category badges, and sold status, with hover effects and click handling.",
  "frontend/src/components/LoginButton.tsx": "Authentication button with dropdown menu showing admin-specific navigation options (Admin Panel, Bulk Upload, Shape Categories) and logout functionality.",
  "frontend/src/components/Model3DViewer.tsx": "3D model viewer using React Three Fiber to render OBJ files with orbit controls, lighting, and error handling fallbacks.",
  "frontend/src/components/PriceEditor.tsx": "Component for editing individual item prices in AUD with input validation and conversion to cents for backend storage.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, blocking interaction until completed.",
  "frontend/src/components/StorefrontHeroMedia.tsx": "Hero section component that displays either a 3D model or image background with customizable title and subtitle text overlay.",
  "frontend/src/components/StripeSetup.tsx": "Dialog component for configuring Stripe payments with secret key and allowed countries input fields. Uses mutation hook to save configuration and displays loading/error states with toast notifications.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useBasket.ts": "Custom hook for managing shopping basket state in localStorage, providing methods to add/remove items, clear basket, and check item presence. Stores item IDs as comma-separated strings and converts to/from Uint8Array.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation. Provides login/logout functions and status tracking with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including items, user profiles, branding, categories, and admin operations. Each hook depends on the actor from useActor and invalidates related queries on mutations.",
  "frontend/src/hooks/useStripe.ts": "React Query hooks for Stripe payment integration including configuration checks, checkout session creation from basket or items list, and session status retrieval. Validates AUD currency requirement and parses JSON responses.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using HSL values for light/dark themes with warm earthy tones (terracotta, clay, sand). Sets serif fonts for body and sans-serif for headings.",
  "frontend/src/lib/idEncoding.ts": "Utility functions to encode Uint8Array item IDs to URL-safe base64 strings and decode them back. Handles base64 padding and character substitution for URL compatibility.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context. Renders the main App component.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin page for configuring store branding including app name, logo, hero media (image/video), and hero text with file upload, preview, and validation capabilities.",
  "frontend/src/pages/AdminBulkUploadPage.tsx": "Admin page for bulk uploading multiple product images with category/shape selection, progress tracking, and post-upload verification of item accessibility.",
  "frontend/src/pages/AdminPanelPage.tsx": "Main admin dashboard providing access to Stripe configuration, category price editing, bulk upload, branding settings, and batch operations like updating 3D printed item descriptions.",
  "frontend/src/pages/AdminShapeCategoriesPage.tsx": "Admin page for managing shape subcategories with add and rename functionality, including confirmation dialogs for rename operations.",
  "frontend/src/pages/BasketPage.tsx": "Shopping basket page displaying items, calculating totals, handling item removal, and initiating Stripe checkout with validation for sold items and eligibility checks.",
  "frontend/src/pages/ItemDetailPage.tsx": "Displays detailed item information with image, price, and purchase options (add to basket or buy now). Includes admin controls for editing item details, price, and publishing status.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a cancellation message when payment fails or is cancelled, with options to return to storefront or view basket.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirms successful payment, fetches Stripe session status, clears the basket, and invalidates item queries to refresh sold status.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page displaying hero media and item grid with filtering/sorting controls (all items, price ascending/descending, category filters).",
  "frontend/src/utils/brandingMedia.ts": "Validates and processes hero media files (images and 3D models), inferring content types and building MediaKind objects for supported formats.",
  "frontend/src/utils/bulkUploadVerification.ts": "Verifies bulk-uploaded items by fetching each item, checking photo blob existence, and performing HEAD requests to confirm image accessibility.",
  "frontend/src/utils/currency.ts": "Formats prices from cents to Australian Dollar currency strings using Intl.NumberFormat.",
  "frontend/src/utils/itemCategory.ts": "Maps between UI labels ('3D printed', 'Ceramic') and backend ItemCategory enum values, providing category options for selection.",
  "frontend/src/utils/shapeCategory.ts": "Provides utility functions for dynamic shape subcategories stored as strings, including label retrieval and validation.",
  "frontend/src/utils/storefrontListing.ts": "Defines ViewMode types and applies filtering/sorting logic to item arrays based on selected view mode (all, price, category).",
  "frontend/src/utils/urlParams.ts": "Extracts and manages URL parameters from query strings and hash-based routing, with sessionStorage persistence and cleanup utilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space, typography, container queries, animations, and custom theme extensions including accordion keyframes and font families.",
  "project_state.json": "Project state tracking file documenting a fix request for an app loading failure after Version 19 deployment, with features focused on diagnosing rendering issues and verifying backend connectivity."
}