{
  "backend/main.mo": "Defines the main canister with item, branding, profile, and basket logic plus access control and storage mixins.",
  "backend/migration.mo": "Provides migration converting old items to new items by adding a default category field.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for reference or tooling.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, layout, branding-aware header, basket icon, footer, and global dialogs.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when a non-admin user attempts to access restricted pages.",
  "frontend/src/components/AdminItemEditor.tsx": "Admin tool for editing an item's description and replacing its image with validation and mutation calls.",
  "frontend/src/components/AdminPublishToggle.tsx": "Toggle button component that publishes or unpublishes an item using mutation hooks and shows status badges and loading states.",
  "frontend/src/components/ItemCard.tsx": "Displays an item preview card with image, title, description, price, and navigation to the item detail page.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout and conditionally shows admin options via a dropdown menu.",
  "frontend/src/components/Model3DViewer.tsx": "Renders a 3D model using react-three-fiber with camera controls, fallback content, and error handling.",
  "frontend/src/components/PriceEditor.tsx": "UI for editing an item's price, validating input, and saving via a mutation hook.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter their name and save a profile.",
  "frontend/src/components/StorefrontHeroMedia.tsx": "Displays either a 3D model or image as hero media along with customizable title and subtitle.",
  "frontend/src/components/StripeSetup.tsx": "Dialog for configuring Stripe secret key and allowed countries, saving settings via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useBasket.ts": "Manages a shopping basket stored in localStorage, exposing helpers to add, remove, check, and list item IDs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as items, profiles, storefront info, and admin checks through the actor API.",
  "frontend/src/hooks/useStripe.ts": "Implements React Query hooks for Stripe integration, including configuration checks, session creation, and session status retrieval.",
  "frontend/src/index.css": "Sets global Tailwind-based theme variables, typography, and utility classes for light and dark modes.",
  "frontend/src/lib/idEncoding.ts": "Provides helper functions to encode and decode item IDs between Uint8Array and URL‑safe base64 strings.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin page for editing branding, allowing logo and hero media uploads, previews, text updates, and saving changes to the backend.",
  "frontend/src/pages/AdminBulkUploadPage.tsx": "Admin interface for bulk uploading item photos with progress tracking, category assignment, verification, and post-upload navigation.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page that checks admin and Stripe config status and provides navigation and controls for Stripe setup and branding settings.",
  "frontend/src/pages/BasketPage.tsx": "Basket management page showing items, handling removal and checkout, and validating item and Stripe readiness before starting a checkout session.",
  "frontend/src/pages/ItemDetailPage.tsx": "Item detail page displaying item info, purchase options, admin tools, and handling add‑to‑basket and direct checkout flows.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple page informing users that payment was cancelled and offering navigation back to storefront or basket.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page that clears the basket, refreshes item status, checks Stripe session state, and confirms the purchase.",
  "frontend/src/pages/StorefrontPage.tsx": "Storefront landing page showing hero media and a grid of items or fallback messaging when items are unavailable.",
  "frontend/src/utils/brandingMedia.ts": "Utility functions for validating hero media files, inferring content types, and constructing MediaKind objects for images and 3D models.",
  "frontend/src/utils/bulkUploadVerification.ts": "Verifies bulk-uploaded items by fetching each item and confirming its image URL is accessible.",
  "frontend/src/utils/itemCategory.ts": "Maps between item category labels and backend enums and provides available category options.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters (including hash-based), persisting them in sessionStorage, and clearing them from the URL when needed.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, color tokens, typography, container settings, animations, and plugin setup.",
  "project_state.json": "Project state document detailing current features, architecture notes, known issues, and versioned requirements for a storefront with admin tools and Stripe integration."
}