{
  "backend/main.mo": "Main backend actor with item management (CRUD, bulk upload), user profiles, Stripe checkout integration, access control via MixinAuthorization, and blob storage via MixinStorage; includes migration support and defines Item, UserProfile, and BulkItemInput types.",
  "backend/migration.mo": "Migration module that transforms OldActor state (with itineraries, baskets, branding, shape categories) to NewActor state (only items, userProfiles, stripeConfig), effectively removing deprecated features.",
  "feature_evidence.json": "Feature evidence report documenting removal of itinerary-related frontend code, addition of quantity display to ItemCard, and implementation of storefront sorting by category and shape subcategory.",
  "frontend-file-summaries.txt": "Summaries of frontend files including App.tsx with simplified header/footer, ItemCard with quantity display, StorefrontPage with placeholder message, AdminBulkUploadPage with ExternalBlob upload, and useQueries.ts with removed item management hooks.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Production deployment checklist for Draft Version 13 verifying storefront controls (view modes, sorting, filtering), admin functionality, payment flow, cross-browser compatibility, and performance requirements.",
  "frontend/index.css": "Global Tailwind CSS with custom OKLCH color variables for light/dark themes using warm earthy tones (terracotta, clay, sand) for folk market aesthetic.",
  "frontend/index.html": "HTML entry point with 'Folk Market' title, viewport meta tag, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup, QueryClient provider, header with app name and basket count, LoginButton with admin dropdown, footer with attribution, and routes for storefront, item detail, basket, payment, and admin pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied message with a shield icon and a button to return to the storefront when users lack admin privileges.",
  "frontend/src/components/AdminItemEditor.tsx": "Empty file, no implementation present.",
  "frontend/src/components/AdminPublishToggle.tsx": "Empty file, no implementation present.",
  "frontend/src/components/CategoryPriceEditor.tsx": "Empty file, no implementation present.",
  "frontend/src/components/ItemCard.tsx": "Empty file, no implementation present.",
  "frontend/src/components/ItemNameEditor.tsx": "Empty file, no implementation present.",
  "frontend/src/components/ItineraryForm.tsx": "Empty file, no implementation present.",
  "frontend/src/components/LoginButton.tsx": "Provides authentication UI with login/logout functionality and a dropdown menu showing admin panel and bulk upload links for admin users.",
  "frontend/src/components/Model3DViewer.tsx": "Renders a 3D model viewer using React Three Fiber with orbit controls, ambient and directional lighting for displaying GLTF models.",
  "frontend/src/components/PriceEditor.tsx": "Empty file, no implementation present.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, blocking interaction until profile setup is complete.",
  "frontend/src/components/QuantityEditor.tsx": "Empty file, no implementation present.",
  "frontend/src/components/StorefrontHeroMedia.tsx": "Empty file, no implementation present.",
  "frontend/src/components/StripeSetup.tsx": "Dialog component for configuring Stripe payment settings including secret key and allowed country codes, with validation and save functionality.",
  "frontend/src/components/SubcategoryEditor.tsx": "Empty file, no implementation present.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useBasket.ts": "Manages shopping basket state in localStorage with functions to add, remove, clear items and check basket contents using Uint8Array item IDs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching user profiles, items, admin status, and bulk uploading items using the backend actor.",
  "frontend/src/hooks/useStripe.ts": "Provides React Query hooks for Stripe integration including configuration checks, setting credentials, creating checkout sessions, and retrieving session status.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a warm earthy color palette (terracotta, clay, sand) for light and dark modes, plus custom typography using serif and sans-serif fonts.",
  "frontend/src/lib/idEncoding.ts": "Provides functions to encode Uint8Array item IDs to URL-safe base64 strings and decode them back.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the App component.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Empty file placeholder for admin branding page functionality.",
  "frontend/src/pages/AdminBulkUploadPage.tsx": "Admin page for bulk uploading multiple items with photos, category selection, and upload progress tracking; requires admin authentication.",
  "frontend/src/pages/AdminItineraryManagementPage.tsx": "Empty file placeholder for admin itinerary management page functionality.",
  "frontend/src/pages/AdminPanelPage.tsx": "Main admin dashboard showing Stripe configuration status and navigation to bulk upload; requires admin authentication.",
  "frontend/src/pages/AdminShapeCategoriesPage.tsx": "Empty file placeholder for admin shape categories management page functionality.",
  "frontend/src/pages/BasketPage.tsx": "Shopping basket page displaying item count with clear basket functionality; shows placeholder message for backend updates.",
  "frontend/src/pages/ItemDetailPage.tsx": "Item detail page that extracts itemId from route params; currently shows placeholder message for backend updates.",
  "frontend/src/pages/ItineraryPage.tsx": "Empty file placeholder for itinerary page functionality.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment cancellation page with options to return to basket or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page that clears the basket, invalidates item queries, and shows confirmation message.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page with hero section and item browsing area; currently shows placeholder for backend updates.",
  "frontend/src/utils/brandingMedia.ts": "Empty file placeholder for branding media utility functions.",
  "frontend/src/utils/bulkUploadVerification.ts": "Verifies bulk uploaded items are retrievable and their images are accessible by fetching items and checking image URLs.",
  "frontend/src/utils/currency.ts": "Formats price values in cents to Australian Dollar (AUD) currency strings.",
  "frontend/src/utils/itemCategory.ts": "Maps between UI category labels (3D printed, Ceramic) and backend ItemCategory enum values with helper functions.",
  "frontend/src/utils/shapeCategory.ts": "Utility functions for working with dynamic shape subcategory strings including validation and label retrieval.",
  "frontend/src/utils/storefrontListing.ts": "Empty file placeholder for storefront listing utility functions.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from hash-based and browser routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with custom fonts (serif/sans), border radius variables, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document showing Folk Market application transitioning from itinerary/trip planning to inventory/item management, with completed features removing itinerary components and adding item quantity display and sorting capabilities."
}