{
  "kind": "build_request",
  "title": "Fix uploaded item photos not appearing in Ocarina store",
  "projectName": "Ocarina Store",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Fix the backend image/blob persistence so that photos uploaded via bulk upload and via the admin “Replace Item Image” flow are actually stored in blob storage and remain retrievable later via the stored ExternalBlob reference.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Its not showing the photos i upload to ocarina store"
        ]
      },
      "acceptanceCriteria": [
        "After bulk uploading one or more images, calling the backend to fetch each created item returns an item whose `photo.getDirectURL()` resolves to an accessible URL that returns HTTP 200 and an image payload.",
        "After replacing an item image via the admin flow, the updated item’s `photo.getDirectURL()` resolves to an accessible URL that returns HTTP 200 and the new image payload.",
        "Refreshing the page (new anonymous actor / new session) still shows the uploaded/replaced images, confirming persistence (not just in-memory state).",
        "The backend continues to store `contentType` for the item and it matches the uploaded file type used to render the image correctly."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Ensure the storefront only shows items that are published, but make the post-upload experience explicitly communicate why newly uploaded items may not appear on the public storefront and guide the admin to publish them.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Its not showing the photos i upload to ocarina store"
        ]
      },
      "acceptanceCriteria": [
        "After a successful bulk upload, the admin UI shows clear English text that newly uploaded items are created as unpublished/drafts and will not appear on the storefront until published.",
        "The bulk upload flow provides an obvious next step for admins (e.g., navigate to an admin item management view or the item pages) so they can publish the uploaded items.",
        "This change does not alter the rule that the public storefront grid only displays `published=true` items."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Improve frontend diagnostics for missing/broken item images so admins can distinguish between (a) an unpublished item not appearing on the storefront and (b) an item image failing to load due to a broken blob URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Its not showing the photos i upload to ocarina store"
        ]
      },
      "acceptanceCriteria": [
        "When an item image fails to load (e.g., 404 from `photo.getDirectURL()`), the UI falls back to the existing placeholder image and also shows a small, clear English indicator on the item detail page for admins (e.g., “Image failed to load”).",
        "The existing storefront item card placeholder behavior remains intact (no broken-image icons shown to users).",
        "Console logging (if any) does not include sensitive data and is limited to actionable debugging information."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Only create backend/migration.mo if an upgrade is required to preserve/repair existing persisted state.",
    "Do not edit files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT; compose them instead.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Do not change the storefront’s published-only visibility rule for items.",
    "Do not add new third-party storage providers or external databases.",
    "Do not add new authentication methods beyond Internet Identity (existing app behavior remains)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}