{
  "kind": "build_request",
  "title": "Add category selection to admin bulk upload (3D printed vs ceramic)",
  "projectName": "Ocarina Storefront",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-43",
      "text": "Add a required category selector to the Admin Bulk Photo Upload page so an admin can choose the category for the items being created, with exactly two options: \"3D printed\" and \"Ceramic\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In the bulk upload page, select the categorie of ocarina to post. There is two categories now  3d printed and ceramic."
        ]
      },
      "acceptanceCriteria": [
        "Admin Bulk Photo Upload page shows a clearly labeled category control before upload starts.",
        "Category selection is required; attempting to upload without selecting a category shows a clear English error message and does not start uploading.",
        "The only selectable values are \"3D printed\" and \"Ceramic\" (spelled exactly as shown)."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Persist a per-item category in the backend item model and set it during bulk upload item creation based on the admin’s selected category (\"3D printed\" or \"Ceramic\").",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There is two categories now  3d printed and ceramic."
        ]
      },
      "acceptanceCriteria": [
        "Backend Item type includes a category field that can represent exactly the two categories: \"3D printed\" and \"Ceramic\".",
        "The bulk upload backend API accepts the selected category and stores it on every created item.",
        "Fetching an item (getItem/getItems/getStorefrontItems) returns the stored category for that item."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Update the frontend bulk upload mutation to send the selected category along with each uploaded image so the backend can tag newly created items appropriately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "select the categorie of ocarina to post"
        ]
      },
      "acceptanceCriteria": [
        "Bulk upload request includes the selected category for the items being created.",
        "If the backend rejects an unknown/missing category, the UI shows a clear English error message and keeps the admin on the upload page."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Add a conditional backend state migration to support upgrading existing stored items when introducing the new category field, assigning a safe default category to all existing items.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "A migration is added that upgrades existing persisted Item records to include the new category field without data loss.",
        "All pre-existing items receive a default category value (choose one default and apply it consistently).",
        "After upgrade, existing pages (storefront list/detail and admin item tools) load items successfully without runtime traps due to missing category."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo (generate backend/migration.mo only if needed for state upgrade).",
    "Do not edit any files under frontend/src/components/ui or any other frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing UI strings."
  ],
  "nonGoals": [
    "Adding category filtering or browsing UI on the public storefront.",
    "Adding more than the two requested categories.",
    "Adding per-photo category selection within a single bulk upload batch (one selected category applies to the upload action unless explicitly extended later)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}