{
  "kind": "build_request",
  "title": "Add guest basket with multi-item Stripe checkout while keeping single-item purchase from item pages",
  "projectName": "Ocarina Market",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Add a guest basket/cart feature that lets users add multiple storefront items to a basket and review/remove items before checkout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "retry building the checkout for multiple items, but allow to buy one only from the store"
        ]
      },
      "acceptanceCriteria": [
        "Storefront users can add an item to a basket without logging in.",
        "Basket contents persist across page refreshes for guests (e.g., localStorage/sessionStorage).",
        "Basket UI shows a list of selected items with title, thumbnail, price, and sold status.",
        "Users can remove individual items from the basket and clear the basket.",
        "Sold items (or items with price not set) are clearly indicated in the basket UI and cannot be checked out."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add a dedicated Basket page/route (e.g., \"/basket\" or \"/cart\") and a header entry point that shows the current basket item count for guests and authenticated users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "retry building the checkout for multiple items, but allow to buy one only from the store"
        ]
      },
      "acceptanceCriteria": [
        "There is a navigable Basket/Cart page route reachable from the global header.",
        "The header displays a basket/cart button/link with an item count badge when the basket is non-empty.",
        "Navigation works with the existing TanStack Router setup.",
        "All user-facing text on the basket/cart UI is in English."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Implement Stripe checkout from the basket for multiple items in a single checkout session, using the existing Stripe checkout flow (success and cancel return pages).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "retry building the checkout for multiple items, but allow to buy one only from the store"
        ]
      },
      "acceptanceCriteria": [
        "From the Basket page, users can start a Stripe Checkout session that includes all eligible (not sold, priced) basket items as line items.",
        "If any basket item becomes sold before checkout begins, the app prevents checkout and prompts the user to update the basket.",
        "On successful return (payment success page), the storefront data is refreshed and purchased items are reflected as sold.",
        "On cancel return (payment failure page), the basket remains unchanged.",
        "The existing guest checkout behavior remains supported (no Internet Identity login required)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Ensure inventory protection (marking items as sold after confirmed payment) works for multi-item basket checkout, not only single-item checkout.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "retry building the checkout for multiple items, but allow to buy one only from the store"
        ]
      },
      "acceptanceCriteria": [
        "For a completed multi-item Stripe session, every purchased item is marked sold in backend state.",
        "Items are not marked sold for cancelled/failed sessions.",
        "If the same item is attempted in two checkouts, only the first completed payment can successfully mark it sold (subsequent attempts must result in the item remaining unavailable).",
        "The sold status updates are observable via existing public item queries (e.g., getItems/getItem)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Keep the storefront purchase UX limited to buying a single item directly from an item detail page (i.e., the existing \"Buy Now\" flow remains single-item), while basket checkout is the only multi-item purchase flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "retry building the checkout for multiple items, but allow to buy one only from the store"
        ]
      },
      "acceptanceCriteria": [
        "Item detail pages continue to offer a single-item \"Buy Now\" checkout for that item only.",
        "Storefront listing cards remain navigation-only (no multi-item checkout initiation directly from the listing).",
        "Multi-item checkout initiation is available only from the Basket page."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo.",
    "Do not edit frontend paths marked immutable in SYSTEM_CONTEXT (compose existing UI components instead).",
    "Do not require Internet Identity authentication to add to basket or to start/complete checkout (guest checkout must remain supported).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (Internet Identity only, and not required for purchasing).",
    "Do not implement real-time updates (no WebSockets).",
    "Do not add external databases or non-Motoko backend services.",
    "Do not introduce multi-vendor, shipping, taxes, discounts, or coupon systems unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}