{
  "kind": "build_request",
  "title": "Branding: upload logo image + editable storefront hero tagline",
  "projectName": "Ocarina Market",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "Update the Branding configuration to include editable storefront hero text (title and subtitle) and expose it publicly so the storefront hero no longer uses hard-coded strings.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "let me upload image for logo in branding. and also let me edit where it says handcrafted ocarinas discover unique...."
        ]
      },
      "acceptanceCriteria": [
        "Backend `Branding` type includes two new fields for hero text (e.g., `heroTitle` and `heroSubtitle`) stored persistently.",
        "`getBranding` returns the new hero text fields and `setBranding` persists them (admin-only, as today).",
        "`getStorefrontItems` response includes the hero text fields needed by the public storefront page (so the storefront can render hero text without extra authenticated calls).",
        "Storefront hero renders the configured hero title/subtitle when set; otherwise falls back to the current default English strings: title \"Handcrafted Ocarinas\" and subtitle \"Discover unique, beautifully crafted ocarinas perfect for collectors and musicians\".",
        "If an upgrade/migration is required due to the Branding schema change, add/adjust `backend/migration.mo` so existing deployments get safe default values for the new fields."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Add an admin-friendly logo image upload control in Branding Settings that uploads an image file and saves it as the branding logo (not only via a pasted URL/path).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "let me upload image for logo in branding. and also let me edit where it says handcrafted ocarinas discover unique...."
        ]
      },
      "acceptanceCriteria": [
        "On `/admin/branding`, provide a \"Logo\" file picker that accepts image files only (e.g., `accept=\"image/*\"`).",
        "Selecting a logo image shows an on-page preview of the chosen image (before saving).",
        "Saving branding after selecting a logo image uploads the file bytes and stores it as `branding.logo` (using the same blob upload approach currently used for hero media uploads).",
        "If no logo file is selected, saving branding keeps the existing logo unless the admin explicitly sets a path/URL field to override it (if the path/URL input remains present).",
        "After saving, the storefront header logo (in `frontend/src/App.tsx`) continues to render from `branding.logo.getDirectURL()` and displays the updated uploaded logo."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Add editable inputs for the storefront hero title and subtitle on the Admin Branding Settings page and persist them via the existing branding save flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...let me edit where it says handcrafted ocarinas discover unique...."
        ]
      },
      "acceptanceCriteria": [
        "On `/admin/branding`, add two labeled text inputs (English labels) for hero title and hero subtitle.",
        "The inputs are pre-populated from the current branding values when available.",
        "Clicking \"Save Branding Settings\" persists the hero title/subtitle along with the existing branding fields (store name, logo, hero media).",
        "If the admin clears either field and saves, the storefront falls back to the default hero text (do not render empty hero text)."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Replace the hard-coded hero title/subtitle in the storefront hero component with values from the backend branding configuration (with fallbacks).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...edit where it says handcrafted ocarinas discover unique...."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/StorefrontHeroMedia.tsx` no longer hard-codes \"Handcrafted Ocarinas\" or the \"Discover unique...\" subtitle.",
        "The hero title/subtitle rendered for both image and 3D hero variants are driven by branding data (as provided to the component via props from the storefront page).",
        "When branding values are missing/empty, the component renders the same default English strings that were previously hard-coded."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in `backend/main.mo`).",
    "Do not edit files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths`.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Changing the existing hero media upload behavior for images/.obj/.3mf beyond what is necessary to support editable hero text.",
    "Adding additional branding fields beyond logo upload and hero title/subtitle editing.",
    "Introducing third-party storage/CDNs or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}