{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Set category-based pricing: 3D ocarinas to $9, ceramic ocarinas to $19",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Create an admin interface that allows bulk price updates by category, enabling future price changes without code modifications",
      "acceptanceCriteria": [
        "Admin panel includes a section for setting prices by category",
        "Admins can select a category and specify a new price",
        "Price changes apply to all items in the selected category",
        "UI shows confirmation of how many items were updated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a react-query mutation hook `useUpdateCategoryPrice` that calls a new backend method to bulk update prices by category. The hook should accept category (ItemCategory) and priceInCents (number) as parameters, return the count of updated items, and invalidate the items query cache on success."
        },
        {
          "path": "frontend/src/components/CategoryPriceEditor.tsx",
          "operation": "create",
          "description": "Create a component that displays a form for bulk category price updates. Include a dropdown to select ItemCategory (using itemCategory.ts helpers), a price input field in AUD (converting to cents), a save button, loading state during mutation, and success feedback showing how many items were updated. Use the useUpdateCategoryPrice hook and display validation errors if price is invalid."
        },
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Add the CategoryPriceEditor component to the admin panel page in a dedicated section titled 'Bulk Pricing by Category'. Position it below the Stripe configuration section and above the bulk description update section. Ensure it is only visible to admin users."
        }
      ]
    }
  ]
}