{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace itinerary management with item management",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Remove all itinerary-related frontend pages, components, and routes",
      "acceptanceCriteria": [
        "ItineraryPage.tsx is removed from frontend/src/pages",
        "AdminItineraryManagementPage.tsx is removed from frontend/src/pages",
        "ItineraryForm.tsx is removed from frontend/src/components",
        "All itinerary routes are removed from App.tsx",
        "Itinerary navigation link is removed from the header"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ItineraryPage.tsx",
          "operation": "delete",
          "description": "Remove the ItineraryPage component that displays user itineraries with product references, date ranges, notes, and locations"
        },
        {
          "path": "frontend/src/pages/AdminItineraryManagementPage.tsx",
          "operation": "delete",
          "description": "Remove the AdminItineraryManagementPage component that provides admin interface for creating, editing, and deleting itineraries"
        },
        {
          "path": "frontend/src/components/ItineraryForm.tsx",
          "operation": "delete",
          "description": "Remove the ItineraryForm component used for creating and editing itineraries with product selection, date ranges, notes, and location entries"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove all itinerary-related route definitions (ItineraryPage and AdminItineraryManagementPage routes) from the router configuration. Remove imports for ItineraryPage and AdminItineraryManagementPage components. Ensure the header navigation no longer includes the itinerary link."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove itinerary-related React Query hooks from useQueries.ts",
      "acceptanceCriteria": [
        "All itinerary query hooks are removed from frontend/src/hooks/useQueries.ts",
        "No compilation errors after removing itinerary hooks"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove all itinerary-related hooks: useItinerariesQuery, useCreateItinerary, useUpdateItinerary, and useDeleteItinerary. Remove any itinerary-related imports and type definitions. Ensure remaining hooks continue to function properly."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add quantity field display to ItemCard component",
      "acceptanceCriteria": [
        "ItemCard displays the quantity value from the Item type",
        "Quantity is clearly labeled and visible on each item card",
        "Quantity display updates when item quantity changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ItemCard.tsx",
          "operation": "modify",
          "description": "Add a quantity display to the ItemCard component that shows the item.quantity value. Place it near the price or in the badge area. Use clear labeling such as 'Quantity: X' or 'Qty: X available'. Ensure it updates reactively when the quantity changes."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Implement item sorting on the storefront by categories and subcategories",
      "acceptanceCriteria": [
        "Items are grouped first by category (Ceramic, 3D Printed)",
        "Within each category group, items are sorted by their shape subcategory",
        "Sorting is applied automatically on the storefront page",
        "Sorting works with existing filter and sort controls"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/storefrontListing.ts",
          "operation": "modify",
          "description": "Add a new sorting function that implements two-level sorting: primary sort by category (ceramic vs printed), then secondary sort by shapeCategory within each category group. Integrate this sorting logic with existing ViewMode filtering and price sorting functionality. Ensure the function returns items sorted first by category, then by subcategory alphabetically within each category."
        },
        {
          "path": "frontend/src/pages/StorefrontPage.tsx",
          "operation": "modify",
          "description": "Apply the new category-subcategory sorting logic from storefrontListing.ts to the items displayed on the storefront. Ensure this sorting is applied after filtering but works in conjunction with any user-selected sort options. The default view should show items grouped by category and sorted by subcategory within each group."
        }
      ]
    }
  ]
}