{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin bulk upload: verify created items and image retrievability before showing success",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Add a post-upload verification step to Admin Bulk Photo Upload so success is only shown after created items are fetchable and their images are retrievable; otherwise show a clear error and remain on the page.",
      "acceptanceCriteria": [
        "After the bulk upload mutation resolves, the UI performs a post-upload verification step (e.g., using the returned item IDs and/or refetching items) before showing the success toast and redirecting.",
        "If verification fails, the UI shows an error toast (English) indicating the upload did not complete correctly, and does not mark all files as success.",
        "On success, React Query caches related to items/storefront are refreshed/invalidated so the newly created items appear without a hard reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/bulkUploadVerification.ts",
          "operation": "create",
          "description": "Create a small verification helper used by the Admin Bulk Photo Upload page to (1) validate the backend returned created item IDs, (2) refetch each created item via existing backend calls, and (3) sanity-check image retrievability by using the blob-storage ExternalBlob direct URL (e.g., calling getDirectURL() and performing a lightweight fetch check). Use the blob-storage component capability (ExternalBlob.getDirectURL()) to validate image rendering viability; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminBulkUploadPage.tsx",
          "operation": "modify",
          "description": "Update the bulk upload flow to: capture the returned created item IDs from bulkUpload.mutateAsync; run a post-upload verification step (using the new helper + actor.getItem) before setting per-file status to success, showing the success toast, and redirecting; on verification failure, keep the user on the upload page, show a clear English error toast, and avoid marking all files as success. Ensure React Query item/storefront caches are invalidated/refetched only after verification passes (explicitly invalidate ['items'] and ['storefrontItems'] via QueryClient). Use blob-storage ExternalBlob direct URLs for verification; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}